class BitOperatorDemo1 
{
	public static void main(String[] args) 
	{
		/*
			遵循规则:
			& :参与运算的两个数,若相应位数的值都为1,则该位结果值是1,否则是0.
			| :参与运算的两个数相应位中只要有一个1,结果就是1.
			^ :参与运算的两个数相对应位相同则结果为0,否则为1.
			~ :表示把每个二进制位的"1"换成"0",把"0"换成"1".
		*/

		/*
			     0b 00000011
			&    0b 00000101
			-----------------------
			     0b 00000001  =   1

				 0b 00000011
			|    0b 00000101
			------------------------
			     0b 00000111  =   7

				 0b 00000011
			^    0b 00000101
			------------------------
			     0b 00000110  =   6

			     0b 00000101
			~    0b 11111010
			        10000101
			+              1
			------------------------
			        10000110  =   - 6
		*/
		System.out.println(3 & 5);
		System.out.println(3 | 5);
		System.out.println(3 ^ 5);
		System.out.println(~ 5);

	}
}
