//移位操作
class  BitOperatorDemo2
{
	public static void main(String[] args) 
	{
		/*
			2的二进制:
			00000010
			左移3位:
			00010000  =  16
        --------------------------
			2的二进制:
			00000010
			移右3位:
			00000000  =  0
		--------------------------
		    -16的二进制:
			10010000
		取反11101111
		+   00000001
		--------------------------
		    11110000
		    右移三位:
			11111110
		取反10000001
		+   00000001
		--------------------------
		    10000010  =  -2


		*/
		System.out.println(2 << 3);//16
		System.out.println(2 >> 3);//0
		System.out.println(- 16 >> 3);//-2
	}
}
